//两个乒乓球队进行比赛，各出三人。甲队为a, b, c三人，乙队为x, y, z三人。已抽签决定比赛名单。有人向队员打听比赛的名单。a说他不和x比，c说他不和x, z比，请编程序找出
//三队赛手的名单。
//简单分析得出：他们的对手也不应该存在相同
#include<stdio.h>
int main()
{
	//i代表a的对手，j代表b的对手，k代表c的对手。
	//由a说他不和x比，c说他不和x, z比。得出 （i != 'x'）&&（k != 'x')&&（k!='z')
	char i, j, k;

	for (i = 'x'; i <= 'z'; i++)
	{
		for (j = 'x'; j <= 'z'; j++)
		{
			if (j != i)
			{
				for (k = 'x'; k <= 'z'; k++)
				{
					if ((j != k) && (i != k))
					{
						if ((i != 'x') && (k != 'x') && (k != 'z'))
						{
							printf("a的对手是：%c:\n", i);
							printf("b的对手是：%c:\n", j);
							printf("c的对手是：%c:\n", k);
						}
					}
				}
			}
		}
	}
	return 0;
}